Tests/Fixtures/Extensions/expected.merged.puml
@startuml
hide empty members
interface "Codable" as Codable <<protocol>> {
}
class "Profile" as Profile <<struct>> {
}
class "Team" as Team <<struct>> {
    users : [User]
}
class "User" as User <<struct>> {
    profile : Profile
    {static} make() : User
    mutating rename(to name: String)
    displayName : String
    {static} preview() : User
}
Team o-- User : users
Codable <|.. User
User *-- Profile : profile
@enduml
